# WireSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSet Class
Members See Also
---
A set that can contain any type of object.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireSet : APIObject, IEnumerable
```

Visual Basic
---
```text
Public Class WireSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class WireSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireSet
# See Also
WireSet Members
Autodesk.Revit.DB.Electrical Namespace